# parameters
nc: 200  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors: 4
#  - [12,16, 19,36, 40,28]  # P3/8
#  - [36,75, 76,55, 72,146]  # P4/16
#  - [142,110, 192,243, 459,401]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0

   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, Conv, [64, 3, 1]],

   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
  
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 11  

   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 16 
   
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 24  

   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 29 
  
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 37  

   [-1, 1, MP, []],
   [-1, 1, Conv, [512, 1, 1]],
   [-3, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 42 
  
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -8], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 50 
   [ -1,3,TRencoder,[ 1024 ] ],
   [ -1, 1, Conv, [ 1024, 1, 1 ] ], #52
  ]

# yolov7 head
head:
  [ [ -1, 1, fuseSPPCSPC, [ 512 ] ], # 53 

    [ -1, 1, Conv, [ 256, 1, 1 ] ],
    [ -1, 1, Conv, [ 256, 1, 1 ] ],
    [ -1, 1, SAConv, [ 128, 3, 1 ] ],
    [ [ -1, -3 ], 1, Concat_ACA, [ 1 ] ],
    [ -1, 1, Conv, [ 256, 1, 1 ] ],

    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ 37, 1, Conv, [ 256, 1, 1 ] ],
    [ 37, 1, Conv, [ 256, 1, 1 ] ],
    [ -1, 1, SAConv, [ 128, 3, 1 ] ],
    [ [ -1, -3 ], 1, Concat_ACA, [ 1 ] ],
    [ -1, 1, Conv, [ 256, 1, 1 ] ], # route backbone P4
    [ [ -1, -2 ], 1, Concat, [ 1 ] ],


    [ -1, 1, Conv, [ 256, 1, 1 ] ],
    [ -2, 1, Conv, [ 256, 1, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 256, 1, 1 ] ], #73

    [ -1, 1, Conv, [ 128, 1, 1 ] ],
    [ -1, 1, Conv, [ 128, 1, 1 ] ],
    [ -1, 1, SAConv, [ 64, 3, 1 ] ],
    [ [ -1, -3 ], 1, Concat_ACA, [ 1 ] ],
    [ -1, 1, Conv, [ 128, 1, 1 ] ],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],
    [ 24, 1, Conv, [ 128, 1, 1 ] ],
    [ 24, 1, Conv, [ 128, 1, 1 ] ],
    [ -1, 1, SAConv, [ 64, 3, 1 ] ],
    [ [ -1, -3 ], 1, Concat_ACA, [ 1 ] ],
    [ -1, 1, Conv, [ 128, 1, 1 ] ], # route backbone P3
    [ [ -1, -2 ], 1, Concat, [ 1 ] ],


    [ -1, 1, Conv, [ 128, 1, 1 ] ],
    [ -2, 1, Conv, [ 128, 1, 1 ] ],
    [ -1, 1, Conv, [ 64, 3, 1 ] ],
    [ -1, 1, Conv, [ 64, 3, 1 ] ],
    [ -1, 1, Conv, [ 64, 3, 1 ] ],
    [ -1, 1, Conv, [ 64, 3, 1 ] ],
    [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 128, 1, 1 ] ], #93


    [ -1, 1, MP, [ ] ],
    [ -1, 1, Conv, [ 128, 1, 1 ] ],
    [ -3, 1, Conv, [ 128, 1, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 2 ] ],
    [ [ -1, -3, 73 ], 1, Concat, [ 1 ] ],


    [ -1, 1, Conv, [ 256, 1, 1 ] ],
    [ -2, 1, Conv, [ 256, 1, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ -1, 1, Conv, [ 128, 3, 1 ] ],
    [ [ -1, -2, -3, -4, -5, -6 ], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 256, 1, 1 ] ], # 106

    [ -1, 1, MP, [ ] ],
    [ -1, 1, Conv, [ 256, 1, 1 ] ],
    [ -3, 1, Conv, [ 256, 1, 1 ] ],
    [ -1, 1, Conv, [ 256, 3, 2 ] ],
    [ [ -1, -3, 53 ], 1, Concat, [ 1 ] ],


    [ -1, 1, Conv, [ 512, 1, 1 ] ],
    [ -2, 1, Conv, [ 512, 1, 1 ] ],
    [ -1, 1, Conv, [ 256, 3, 1 ] ],
    [ -1, 1, Conv, [ 256, 3, 1 ] ],
    [ -1, 1, Conv, [ 256, 3, 1 ] ],
    [ -1, 1, Conv, [ 256, 3, 1 ] ],
    [ [ -1, -2, -3, -4, -5, -6], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 512, 1, 1 ] ], # 119
    [ -1,3,TRencoder,[ 512 ] ],
    [ -1, 1, Conv, [ 512, 1, 1 ] ], #121


   [93, 1, RepConv, [256, 3, 1]],
   [106, 1, RepConv, [512, 3, 1]],
   [121, 1, RepConv, [1024, 3, 1]],

   [[122,123,124], 1, IDetect, [nc, anchors]],   # Detect(P2,P3, P4, P5)
  ]
